FujiNetWIFI/fujinet-firmware/lib/hardware/ESP32UARTChannel.cpp
#include "ESP32UARTChannel.h"
#include "fnSystem.h"
#include "../../include/pinmap.h"
#include "../../include/debug.h"

#include <soc/uart_reg.h>
#include <soc/gpio_sig_map.h>
#include <hal/gpio_types.h>
#include <esp_rom_gpio.h>

#define MAX_FLUSH_WAIT_TICKS 200

// Serial "debug port"
ESP32UARTChannel fnDebugConsole;

void ESP32UARTChannel::begin(const ChannelConfig& conf)
{
    if (_uart_q)
        end();

    _uart_num = conf.device;
    read_timeout_ms = conf.read_timeout_ms;
    discard_timeout_ms = conf.discard_timeout_ms;
    Debug_printv("speed: %i", conf.uart_config.baud_rate);
    uart_param_config(_uart_num, &conf.uart_config);

    controlPins = conf.pins;

    switch (_uart_num)
    {
#ifdef PIN_UART0_RX
    case 0:
        controlPins.rx = PIN_UART0_RX;
        controlPins.tx = PIN_UART0_TX;
        break;
#endif /* PIN_UART0_RX */

#ifdef PIN_UART1_RX
    case 1:
        controlPins.rx = PIN_UART1_RX;
        controlPins.tx = PIN_UART1_TX;
        break;
#endif /* PIN_UART1_RX */

#ifdef PIN_UART2_RX
    case 2:
        controlPins.rx = PIN_UART2_RX;
        controlPins.tx = PIN_UART2_TX;
        break;
#endif /* PIN_UART2_RX */

    default:
        return;
    }

    uart_set_pin(_uart_num, controlPins.tx, controlPins.rx,
                 UART_PIN_NO_CHANGE, UART_PIN_NO_CHANGE);

    uint32_t inv_mask = 0;
    if (conf.isTxInverted)
        inv_mask |= UART_SIGNAL_TXD_INV;
    if (conf.isRxInverted)
        inv_mask |= UART_SIGNAL_RXD_INV;
    if (inv_mask)
        uart_set_line_inverse(_uart_num, inv_mask);

    int uart_buffer_size = 2048;
    int uart_queue_size = 20;
    int intr_alloc_flags = ESP_INTR_FLAG_IRAM;

    uart_driver_install(_uart_num, uart_buffer_size, conf.tx_buffer_size, uart_queue_size, &_uart_q,
                        intr_alloc_flags);

    _halfDuplex = conf.isHalfDuplex;

    // set RTS pin mode
    if (controlPins.rts >= 0)
        fnSystem.set_pin_mode(controlPins.rts, gpio_mode_t::GPIO_MODE_INPUT);
    if (controlPins.cts >= 0)
    {
        fnSystem.set_pin_mode(controlPins.cts, gpio_mode_t::GPIO_MODE_OUTPUT);
        fnSystem.digital_write(controlPins.cts, DIGI_LOW);
    }

    if (controlPins.dtr >= 0)
        fnSystem.set_pin_mode(controlPins.dtr, gpio_mode_t::GPIO_MODE_INPUT);
    if (controlPins.dsr >= 0)
    {
        fnSystem.set_pin_mode(controlPins.dsr, gpio_mode_t::GPIO_MODE_OUTPUT);
        fnSystem.digital_write(controlPins.dsr, DIGI_LOW);
    }

    if (controlPins.dcd >= 0)
    {
        fnSystem.set_pin_mode(controlPins.dcd, gpio_mode_t::GPIO_MODE_OUTPUT);
        fnSystem.digital_write(controlPins.dcd, DIGI_HIGH);
    }

    if (controlPins.ri >= 0)
    {
        fnSystem.set_pin_mode(controlPins.ri, gpio_mode_t::GPIO_MODE_OUTPUT);
        fnSystem.digital_write(controlPins.ri, DIGI_HIGH);
    }

    if (conf.rx_threshold)
        setRXThreshold(conf.rx_threshold);

    return;
}

void ESP32UARTChannel::end()
{
    uart_driver_delete(_uart_num);
    if (_uart_q)
        vQueueDelete(_uart_q);
    _uart_q = NULL;
}

#ifdef CONFIG_IDF_TARGET_ESP32S3
void ESP32UARTChannel::updateFIFO()
{
    uart_event_t event;

    while (_uart_q && xQueueReceive(_uart_q, &event, 1))
    {
        if (event.type == UART_DATA)
        {
            size_t old_len = _fifo.size();
            _fifo.resize(old_len + event.size);
            int result = uart_read_bytes(_uart_num, &_fifo[old_len], event.size, 0);
            if (result < 0)
                result = 0;
            _fifo.resize(old_len + result);
        }
    }

    return;
}
#else /* ! CONFIG_IDF_TARGET_ESP32S3 */
void ESP32UARTChannel::updateFIFO()
{
    size_t avail;
    if (ESP_FAIL == uart_get_buffered_data_len(_uart_num, &avail))
        return;

    size_t old_len = _fifo.size();
    _fifo.resize(old_len + avail);
    int result = uart_read_bytes(_uart_num, &_fifo[old_len], avail, 0);
    if (result < 0)
        result = 0;
    _fifo.resize(old_len + result);

    return;
}
#endif /* CONFIG_IDF_TARGET_ESP32S3 */

void ESP32UARTChannel::flushOutput()
{
    uart_wait_tx_done(_uart_num, MAX_FLUSH_WAIT_TICKS);
}

uint32_t ESP32UARTChannel::getBaudrate()
{
    uint32_t baud;
    uart_get_baudrate(_uart_num, &baud);
    return baud;
}

void ESP32UARTChannel::setBaudrate(uint32_t baud)
{
#ifdef DEBUG
    uint32_t before;
    uart_get_baudrate(_uart_num, &before);
#endif
    uart_set_baudrate(_uart_num, baud);
#ifdef DEBUG
    Debug_printf("set_baudrate change from %d to %d\r\n", before, baud);
#endif
}

size_t ESP32UARTChannel::dataOut(const void *buffer, size_t size)
{
    size_t wlen;
    unsigned uart_rx_idx = 0;


    if (_halfDuplex)
    {
        switch (_uart_num)
        {
        case 0:
            uart_rx_idx = U0RXD_IN_IDX;
            break;
        case 1:
            uart_rx_idx = U1RXD_IN_IDX;
            break;
        case 2:
            uart_rx_idx = U2RXD_IN_IDX;
            break;
        default:
            return 0;
        }

        //esp_rom_gpio_connect_in_signal(GPIO_NUM_NC, uart_rx_idx, false);
        esp_rom_gpio_connect_in_signal(GPIO_MATRIX_CONST_ONE_INPUT, uart_rx_idx, false);
    }

    wlen = uart_write_bytes(_uart_num, (const char *) buffer, size);

    if (_halfDuplex)
    {
        flushOutput();
        esp_rom_gpio_connect_in_signal(controlPins.rx, uart_rx_idx, false);
    }

    return wlen;
}

bool ESP32UARTChannel::getPin(int pin)
{
    if (pin < 0)
        return 0;
    return fnSystem.digital_read(pin) == DIGI_LOW;
}

void ESP32UARTChannel::setPin(int pin, bool state)
{
    if (pin >= 0)
        fnSystem.digital_write(pin, !state);
    return;
}

bool ESP32UARTChannel::getDTR()
{
    return getPin(controlPins.dtr);
}

void ESP32UARTChannel::setDSR(bool state)
{
    setPin(controlPins.dsr, state);
}

bool ESP32UARTChannel::getRTS()
{
    return getPin(controlPins.rts);
}

void ESP32UARTChannel::setCTS(bool state)
{
    setPin(controlPins.cts, state);
}

void ESP32UARTChannel::setDCD(bool state)
{
    setPin(controlPins.dcd, state);
}

void ESP32UARTChannel::setRI(bool state)
{
    setPin(controlPins.ri, state);
}

void ESP32UARTChannel::setRXThreshold(uint8_t thresh)
{
    uint32_t conf1 = READ_PERI_REG(UART_CONF1_REG(_uart_num));
    conf1 &= ~(UART_RXFIFO_FULL_THRHD_V << UART_RXFIFO_FULL_THRHD_S);
    conf1 |= (thresh & UART_RXFIFO_FULL_THRHD_V) << UART_RXFIFO_FULL_THRHD_S;
    WRITE_PERI_REG(UART_CONF1_REG(_uart_num), conf1);
}

uint8_t ESP32UARTChannel::getRXThreshold()
{
    uint32_t conf1 = READ_PERI_REG(UART_CONF1_REG(_uart_num));
    return (conf1 >> UART_RXFIFO_FULL_THRHD_S) & UART_RXFIFO_FULL_THRHD_V;
}
